Revit 2027 API
GroupTypeId.FabricationProductData Property
 Fabrication Product Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductData { get; }
Public Shared ReadOnly Property FabricationProductData As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductData {
	ForgeTypeId^ get ();
}
static member FabricationProductData : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace